In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [3]:
data = Series (['one','two',np.nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [4]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
data.dropna

<bound method Series.dropna of 0     one
1     two
2     NaN
3    four
dtype: object>

In [7]:
dframe= DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [8]:
clean_dframe = dframe.dropna()
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [9]:
dframe.dropna(how='all') #drop row with all nan values

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [11]:
dframe.dropna(axis=1)#drop axis if it has a nan - it will drop all in this case

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [12]:
npn=np.nan
dframe2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [15]:
dframe2.dropna(thresh=2)#if there are no 2 data points defined at least drop it

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [17]:
dframe2.dropna(thresh=3)#if there are no 3 data points defined at least drop it

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [19]:
dframe2.fillna(1) #fill nan values

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [20]:
#now let's fill different values for different columns

In [21]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [22]:
dframe2.fillna({0:0,1:1,2:2,3:3}) #we will use a dictionary

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [24]:
dframe2.fillna(0) #this change it but doesn't modify the existing object

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [31]:
dframe2.fillna(0,inplace=True) #this will modify the existing object 
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0